analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/dbb_rffe_regs.h
/**@} end of group DBB_RFFE_RFFE_IFC_RFFE_VERSION_Register */

/**
 * @ingroup  dbb_rffe_registers
 * @defgroup DBB_RFFE_GENERAL_PARAM DBB_RFFE_GENERAL_PARAM
 * @brief    param
 * @{
 */
#define MXC_F_DBB_RFFE_GENERAL_PARAM_BYP_CDC_POS       0 /**< GENERAL_PARAM_BYP_CDC Position */
#define MXC_F_DBB_RFFE_GENERAL_PARAM_BYP_CDC           ((uint16_t)(0x1UL << MXC_F_DBB_RFFE_GENERAL_PARAM_BYP_CDC_POS)) /**< GENERAL_PARAM_BYP_CDC Mask */

#define MXC_F_DBB_RFFE_GENERAL_PARAM_SWAP_IQ_POS       1 /**< GENERAL_PARAM_SWAP_IQ Position */
#define MXC_F_DBB_RFFE_GENERAL_PARAM_SWAP_IQ           ((uint16_t)(0x1UL << MXC_F_DBB_RFFE_GENERAL_PARAM_SWAP_IQ_POS)) /**< GENERAL_PARAM_SWAP_IQ Mask */

#define MXC_F_DBB_RFFE_GENERAL_PARAM_SWAP_AM_FM_POS    2 /**< GENERAL_PARAM_SWAP_AM_FM Position */
#define MXC_F_DBB_RFFE_GENERAL_PARAM_SWAP_AM_FM        ((uint16_t)(0x1UL << MXC_F_DBB_RFFE_GENERAL_PARAM_SWAP_AM_FM_POS)) /**< GENERAL_PARAM_SWAP_AM_FM Mask */

/**@} end of group DBB_RFFE_GENERAL_PARAM_Register */

/**
 * @ingroup  dbb_rffe_registers
 * @defgroup DBB_RFFE_GENERAL_DELAY_FREQ DBB_RFFE_GENERAL_DELAY_FREQ
 * @brief    delay_freq
 * @{
 */
#define MXC_F_DBB_RFFE_GENERAL_DELAY_FREQ_LOW_POS      0 /**< GENERAL_DELAY_FREQ_LOW Position */
#define MXC_F_DBB_RFFE_GENERAL_DELAY_FREQ_LOW          ((uint16_t)(0x3FUL << MXC_F_DBB_RFFE_GENERAL_DELAY_FREQ_LOW_POS)) /**< GENERAL_DELAY_FREQ_LOW Mask */

#define MXC_F_DBB_RFFE_GENERAL_DELAY_FREQ_HIGH_POS     6 /**< GENERAL_DELAY_FREQ_HIGH Position */
#define MXC_F_DBB_RFFE_GENERAL_DELAY_FREQ_HIGH         ((uint16_t)(0x3FUL << MXC_F_DBB_RFFE_GENERAL_DELAY_FREQ_HIGH_POS)) /**< GENERAL_DELAY_FREQ_HIGH Mask */

/**@} end of group DBB_RFFE_GENERAL_DELAY_FREQ_Register */

/**
 * @ingroup  dbb_rffe_registers
 * @defgroup DBB_RFFE_GENERAL_SKIP_SDMOD DBB_RFFE_GENERAL_SKIP_SDMOD
 * @brief    skip_sdmod
 * @{
 */
#define MXC_F_DBB_RFFE_GENERAL_SKIP_SDMOD_DIV_POS      0 /**< GENERAL_SKIP_SDMOD_DIV Position */
#define MXC_F_DBB_RFFE_GENERAL_SKIP_SDMOD_DIV          ((uint32_t)(0x1UL << MXC_F_DBB_RFFE_GENERAL_SKIP_SDMOD_DIV_POS)) /**< GENERAL_SKIP_SDMOD_DIV Mask */

#define MXC_F_DBB_RFFE_GENERAL_SKIP_SDMOD_AMP_POS      1 /**< GENERAL_SKIP_SDMOD_AMP Position */
#define MXC_F_DBB_RFFE_GENERAL_SKIP_SDMOD_AMP          ((uint32_t)(0x1UL << MXC_F_DBB_RFFE_GENERAL_SKIP_SDMOD_AMP_POS)) /**< GENERAL_SKIP_SDMOD_AMP Mask */

/**@} end of group DBB_RFFE_GENERAL_SKIP_SDMOD_Register */

/**
 * @ingroup  dbb_rffe_registers
 * @defgroup DBB_RFFE_TX_SEQ_SPI DBB_RFFE_TX_SEQ_SPI
 * @brief    spi
 * @{
 */
#define MXC_F_DBB_RFFE_TX_SEQ_SPI_CLK_RATE_POS         0 /**< TX_SEQ_SPI_CLK_RATE Position */
#define MXC_F_DBB_RFFE_TX_SEQ_SPI_CLK_RATE             ((uint32_t)(0xFUL << MXC_F_DBB_RFFE_TX_SEQ_SPI_CLK_RATE_POS)) /**< TX_SEQ_SPI_CLK_RATE Mask */

#define MXC_F_DBB_RFFE_TX_SEQ_SPI_ENDIANESS_POS        4 /**< TX_SEQ_SPI_ENDIANESS Position */
#define MXC_F_DBB_RFFE_TX_SEQ_SPI_ENDIANESS            ((uint32_t)(0x1UL << MXC_F_DBB_RFFE_TX_SEQ_SPI_ENDIANESS_POS)) /**< TX_SEQ_SPI_ENDIANESS Mask */

#define MXC_F_DBB_RFFE_TX_SEQ_SPI_CPOL_POS             5 /**< TX_SEQ_SPI_CPOL Position */
#define MXC_F_DBB_RFFE_TX_SEQ_SPI_CPOL                 ((uint32_t)(0x1UL << MXC_F_DBB_RFFE_TX_SEQ_SPI_CPOL_POS)) /**< TX_SEQ_SPI_CPOL Mask */

#define MXC_F_DBB_RFFE_TX_SEQ_SPI_CPHA_POS             6 /**< TX_SEQ_SPI_CPHA Position */
#define MXC_F_DBB_RFFE_TX_SEQ_SPI_CPHA                 ((uint32_t)(0x1UL << MXC_F_DBB_RFFE_TX_SEQ_SPI_CPHA_POS)) /**< TX_SEQ_SPI_CPHA Mask */

#define MXC_F_DBB_RFFE_TX_SEQ_SPI_ENABLE_POS           7 /**< TX_SEQ_SPI_ENABLE Position */
#define MXC_F_DBB_RFFE_TX_SEQ_SPI_ENABLE               ((uint32_t)(0x1UL << MXC_F_DBB_RFFE_TX_SEQ_SPI_ENABLE_POS)) /**< TX_SEQ_SPI_ENABLE Mask */

/**@} end of group DBB_RFFE_TX_SEQ_SPI_Register */

/**
 * @ingroup  dbb_rffe_registers
 * @defgroup DBB_RFFE_RX_SEQ_SPI DBB_RFFE_RX_SEQ_SPI
 * @brief    spi
 * @{
 */
#define MXC_F_DBB_RFFE_RX_SEQ_SPI_CLK_RATE_POS         0 /**< RX_SEQ_SPI_CLK_RATE Position */
#define MXC_F_DBB_RFFE_RX_SEQ_SPI_CLK_RATE             ((uint32_t)(0xFUL << MXC_F_DBB_RFFE_RX_SEQ_SPI_CLK_RATE_POS)) /**< RX_SEQ_SPI_CLK_RATE Mask */

#define MXC_F_DBB_RFFE_RX_SEQ_SPI_ENDIANESS_POS        4 /**< RX_SEQ_SPI_ENDIANESS Position */
#define MXC_F_DBB_RFFE_RX_SEQ_SPI_ENDIANESS            ((uint32_t)(0x1UL << MXC_F_DBB_RFFE_RX_SEQ_SPI_ENDIANESS_POS)) /**< RX_SEQ_SPI_ENDIANESS Mask */

#define MXC_F_DBB_RFFE_RX_SEQ_SPI_CPOL_POS             5 /**< RX_SEQ_SPI_CPOL Position */
#define MXC_F_DBB_RFFE_RX_SEQ_SPI_CPOL                 ((uint32_t)(0x1UL << MXC_F_DBB_RFFE_RX_SEQ_SPI_CPOL_POS)) /**< RX_SEQ_SPI_CPOL Mask */

#define MXC_F_DBB_RFFE_RX_SEQ_SPI_CPHA_POS             6 /**< RX_SEQ_SPI_CPHA Position */
#define MXC_F_DBB_RFFE_RX_SEQ_SPI_CPHA                 ((uint32_t)(0x1UL << MXC_F_DBB_RFFE_RX_SEQ_SPI_CPHA_POS)) /**< RX_SEQ_SPI_CPHA Mask */

#define MXC_F_DBB_RFFE_RX_SEQ_SPI_ENABLE_POS           7 /**< RX_SEQ_SPI_ENABLE Position */
#define MXC_F_DBB_RFFE_RX_SEQ_SPI_ENABLE               ((uint32_t)(0x1UL << MXC_F_DBB_RFFE_RX_SEQ_SPI_ENABLE_POS)) /**< RX_SEQ_SPI_ENABLE Mask */

/**@} end of group DBB_RFFE_RX_SEQ_SPI_Register */

/**
 * @ingroup  dbb_rffe_registers
 * @defgroup DBB_RFFE_RFFE_SPIM_CFG DBB_RFFE_RFFE_SPIM_CFG
 * @brief    cfg
 * @{
 */
#define MXC_F_DBB_RFFE_RFFE_SPIM_CFG_CLK_RATE_POS      0 /**< RFFE_SPIM_CFG_CLK_RATE Position */
#define MXC_F_DBB_RFFE_RFFE_SPIM_CFG_CLK_RATE          ((uint16_t)(0xFUL << MXC_F_DBB_RFFE_RFFE_SPIM_CFG_CLK_RATE_POS)) /**< RFFE_SPIM_CFG_CLK_RATE Mask */

#define MXC_F_DBB_RFFE_RFFE_SPIM_CFG_ENDIANESS_POS     4 /**< RFFE_SPIM_CFG_ENDIANESS Position */
#define MXC_F_DBB_RFFE_RFFE_SPIM_CFG_ENDIANESS         ((uint16_t)(0x1UL << MXC_F_DBB_RFFE_RFFE_SPIM_CFG_ENDIANESS_POS)) /**< RFFE_SPIM_CFG_ENDIANESS Mask */

#define MXC_F_DBB_RFFE_RFFE_SPIM_CFG_CPOL_POS          5 /**< RFFE_SPIM_CFG_CPOL Position */
#define MXC_F_DBB_RFFE_RFFE_SPIM_CFG_CPOL              ((uint16_t)(0x1UL << MXC_F_DBB_RFFE_RFFE_SPIM_CFG_CPOL_POS)) /**< RFFE_SPIM_CFG_CPOL Mask */

#define MXC_F_DBB_RFFE_RFFE_SPIM_CFG_CPHA_POS          6 /**< RFFE_SPIM_CFG_CPHA Position */
#define MXC_F_DBB_RFFE_RFFE_SPIM_CFG_CPHA              ((uint16_t)(0x1UL << MXC_F_DBB_RFFE_RFFE_SPIM_CFG_CPHA_POS)) /**< RFFE_SPIM_CFG_CPHA Mask */

#define MXC_F_DBB_RFFE_RFFE_SPIM_CFG_ENABLE_POS        7 /**< RFFE_SPIM_CFG_ENABLE Position */
#define MXC_F_DBB_RFFE_RFFE_SPIM_CFG_ENABLE            ((uint16_t)(0x1UL << MXC_F_DBB_RFFE_RFFE_SPIM_CFG_ENABLE_POS)) /**< RFFE_SPIM_CFG_ENABLE Mask */

/**@} end of group DBB_RFFE_RFFE_SPIM_CFG_Register */

/**
 * @ingroup  dbb_rffe_registers
 * @defgroup DBB_RFFE_AGC_SPI_CFG DBB_RFFE_AGC_SPI_CFG
 * @brief    cfg
 * @{
 */
#define MXC_F_DBB_RFFE_AGC_SPI_CFG_CLK_RATE_POS        0 /**< AGC_SPI_CFG_CLK_RATE Position */
#define MXC_F_DBB_RFFE_AGC_SPI_CFG_CLK_RATE            ((uint32_t)(0xFUL << MXC_F_DBB_RFFE_AGC_SPI_CFG_CLK_RATE_POS)) /**< AGC_SPI_CFG_CLK_RATE Mask */

#define MXC_F_DBB_RFFE_AGC_SPI_CFG_ENDIANESS_POS       4 /**< AGC_SPI_CFG_ENDIANESS Position */
#define MXC_F_DBB_RFFE_AGC_SPI_CFG_ENDIANESS           ((uint32_t)(0x1UL << MXC_F_DBB_RFFE_AGC_SPI_CFG_ENDIANESS_POS)) /**< AGC_SPI_CFG_ENDIANESS Mask */

