analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/dbb_rffe_regs.h
#define MXC_F_DBB_RFFE_AGC_SPI_CFG_CPOL_POS            5 /**< AGC_SPI_CFG_CPOL Position */
#define MXC_F_DBB_RFFE_AGC_SPI_CFG_CPOL                ((uint32_t)(0x1UL << MXC_F_DBB_RFFE_AGC_SPI_CFG_CPOL_POS)) /**< AGC_SPI_CFG_CPOL Mask */

#define MXC_F_DBB_RFFE_AGC_SPI_CFG_CPHA_POS            6 /**< AGC_SPI_CFG_CPHA Position */
#define MXC_F_DBB_RFFE_AGC_SPI_CFG_CPHA                ((uint32_t)(0x1UL << MXC_F_DBB_RFFE_AGC_SPI_CFG_CPHA_POS)) /**< AGC_SPI_CFG_CPHA Mask */

#define MXC_F_DBB_RFFE_AGC_SPI_CFG_ENABLE_POS          7 /**< AGC_SPI_CFG_ENABLE Position */
#define MXC_F_DBB_RFFE_AGC_SPI_CFG_ENABLE              ((uint32_t)(0x1UL << MXC_F_DBB_RFFE_AGC_SPI_CFG_ENABLE_POS)) /**< AGC_SPI_CFG_ENABLE Mask */

/**@} end of group DBB_RFFE_AGC_SPI_CFG_Register */

/**
 * @ingroup  dbb_rffe_registers
 * @defgroup DBB_RFFE_AGC_ENC5_DC_OFFS DBB_RFFE_AGC_ENC5_DC_OFFS
 * @brief    dc_offs
 * @{
 */
#define MXC_F_DBB_RFFE_AGC_ENC5_DC_OFFS_ENABLE_POS     0 /**< AGC_ENC5_DC_OFFS_ENABLE Position */
#define MXC_F_DBB_RFFE_AGC_ENC5_DC_OFFS_ENABLE         ((uint16_t)(0x1UL << MXC_F_DBB_RFFE_AGC_ENC5_DC_OFFS_ENABLE_POS)) /**< AGC_ENC5_DC_OFFS_ENABLE Mask */

#define MXC_F_DBB_RFFE_AGC_ENC5_DC_OFFS_BYPASS_EN_POS  1 /**< AGC_ENC5_DC_OFFS_BYPASS_EN Position */
#define MXC_F_DBB_RFFE_AGC_ENC5_DC_OFFS_BYPASS_EN      ((uint16_t)(0x1UL << MXC_F_DBB_RFFE_AGC_ENC5_DC_OFFS_BYPASS_EN_POS)) /**< AGC_ENC5_DC_OFFS_BYPASS_EN Mask */

/**@} end of group DBB_RFFE_AGC_ENC5_DC_OFFS_Register */

/**
 * @ingroup  dbb_rffe_registers
 * @defgroup DBB_RFFE_IQ_CTRL DBB_RFFE_IQ_CTRL
 * @brief    iq_ctrl
 * @{
 */
#define MXC_F_DBB_RFFE_IQ_CTRL_ENABLE_POS              0 /**< IQ_CTRL_ENABLE Position */
#define MXC_F_DBB_RFFE_IQ_CTRL_ENABLE                  ((uint32_t)(0x1UL << MXC_F_DBB_RFFE_IQ_CTRL_ENABLE_POS)) /**< IQ_CTRL_ENABLE Mask */

#define MXC_F_DBB_RFFE_IQ_CTRL_DONE_POS                1 /**< IQ_CTRL_DONE Position */
#define MXC_F_DBB_RFFE_IQ_CTRL_DONE                    ((uint32_t)(0x1UL << MXC_F_DBB_RFFE_IQ_CTRL_DONE_POS)) /**< IQ_CTRL_DONE Mask */

/**@} end of group DBB_RFFE_IQ_CTRL_Register */

#ifdef __cplusplus
}
#endif

#endif // MAX32665_INCLUDE_DBB_RFFE_REGS_H_
